- **interdisiplinary schools**
- **Fatemeh Jafari**

# **"PANDAS LIBRARY"**

## **Session 3: Pandas for Data Analysis**

- **Working with DataFrames**

- **Data Selection and Filtering**

- **Grouping and Combining**

- **interdisiplinary schools**
- **Fatemeh Jafari**

# **"PANDAS LIBRARY"**

## Session 3: Pandas for Data Analysis

- **Working with DataFrames**

- **Data Selection and Filtering**

- **Grouping and Combining**

---

# **Basic data structures in pandas**

- *Pandas provides two types of classes for handling data:*

*`Series:` a one-dimensional labeled array holding data of any type such as integers, strings, Python objects etc.*

*`DataFrame:` a two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns.*

## **Basic Data Structures in Pandas**

| Concept | Description | Example |
|--------|-------------|---------|
| Series | 1D labeled array | `pd.Series([1, 2, 3])` |
| DataFrame | 2D labeled data structure | `pd.DataFrame({'a': [1, 2]})` |

In [1]:
import numpy as np
import pandas as pd

# **series**

### *1. creating series using dict:*

In [ ]:

ps = {'a': 12 , 'b': 34 , 'c': 56 , 'd': 78}


pd_series = pd.Series(ps)
pd_series

a    12
b    34
c    56
d    78
dtype: int64

In [7]:
pd_series[0]

C:\Users\fjafa\AppData\Local\Temp\ipykernel_2640\202343469.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  pd_series[0]

np.int64(12)

In [8]:
pd_series['a']

np.int64(12)

In [9]:
print('a' in ps)
print(12 in ps)

True
False

In [4]:

ps = {'a': 12 , 'b': 34 , 'c': 56 , 'd': 78}


pd_series = pd.Series(ps)
pd_series

a    12
b    34
c    56
d    78
dtype: int64

### *2. creating series using lists:*

In [10]:
ps = ['345' , '123' , '567' , '789' ]
pd_series = pd.Series(ps)
pd_series

0    345
1    123
2    567
3    789
dtype: object

In [11]:
pd_series[0]

'345'

- ## *changing index with specific values :*

In [13]:
list1 = [0 , 2 , 5 , 7]
pd_series = pd.Series(data= list1,
                     index= ['a' , 'b' , 'c' , 'd'])
pd_series

a    0
b    2
c    5
d    7
dtype: int64

In [14]:
pd_series = pd.Series(data= [0 , 2 , 5 , 7],
                     index= ['a' , 'b' , 'c' , 'd'])
pd_series

a    0
b    2
c    5
d    7
dtype: int64

In [15]:

bold_signal = list(0.4 + 0.05*np.random.randn(300))


time_sec = [i*2 for i in range(300)] 

s = pd.Series(bold_signal, index=time_sec)
print(s.head())

0    0.386297
2    0.404580
4    0.400280
6    0.373000
8    0.346340
dtype: float64

| Method            | Input                     | Index Behavior                |
| ----------------- | ------------------------- | ----------------------------- |
| From a list       | `[3.2, 5.1, 4.8]`         | Automatic: 0, 1, 2            |
| From a dictionary | `{"Ali": 18, "Sara": 19}` | Keys become the index values  |
| With custom index | `values + index`          | Index is exactly what you set |

In [16]:
s = pd.Series([2, 4, 6])
result = s * 10
print(result)

0    20
1    40
2    60
dtype: int64

## *Automatic Alignment*

In [5]:
s1 = pd.Series([2, 4, 6], index=[0, 1, 2])
s1

0    2
1    4
2    6
dtype: int64

In [6]:
s2 = pd.Series([10, 20], index=[0, 1])  
s2

0    10
1    20
dtype: int64

In [17]:
s1 = pd.Series([2, 4, 6], index=[0, 1, 2])
s2 = pd.Series([10, 20], index=[0, 1])  

print(s1 + s2)

0    12.0
1    24.0
2     NaN
dtype: float64

In [18]:
s1 = pd.Series([10, 20, 30], index=["A", "B", "C"])
s2 = pd.Series([1, 2, 3], index=["B", "C", "D"])

print(s1 + s2)

A     NaN
B    21.0
C    32.0
D     NaN
dtype: float64

| index | s1 | s2 | s1 + s2 |
| ----- | -- | -- | ------- |
| A     | 10 | –  | NaN     |
| B     | 20 | 1  | 21      |
| C     | 30 | 2  | 32      |
| D     | –  | 3  | NaN     |

In [19]:
s1 = pd.Series([100, 200, 300], index=["V1", "FFA", "PPA"])
s2 = pd.Series([1.2, 0.9], index=["FFA", "PPA"])

print(s1 * s2)

FFA    240.0
PPA    270.0
V1       NaN
dtype: float64

In [20]:
s1 = pd.Series([100, 200, 300], index=["V1", "FFA", "PPA"])
s2 = pd.Series([1.2, 0.9], index=["FF", "PA"])

print(s1 * s2)

FF    NaN
FFA   NaN
PA    NaN
PPA   NaN
V1    NaN
dtype: float64

In [21]:
s1 = pd.Series([10, 20, 30], index=[0, 1, 2])
s2 = pd.Series([1, 2, 3], index=["A", "B", "C"])

print(s1 + s2)

0   NaN
1   NaN
2   NaN
A   NaN
B   NaN
C   NaN
dtype: float64

---

# **DataFrame**

| Method          | Data Type                       | Common Use Case                      |
| --------------- | ------------------------------- | ------------------------------------ |
| **Dictionary**  | Labeled and named columns       | Tabular data, JSON, cleaned datasets |
| **List**        | Row-by-row data                 | Event files, loop outputs            |
| **NumPy array** | Numerical or matrix-shaped data | fMRI/EEG data, measurement matrices  |

In [7]:
dict11 = {
    'Subject': ['S01', 'S02', 'S03'],
    'Age': [23, 31, 29],
    'Group': ['Control', 'Patient', 'Control']
}
data = pd.DataFrame(dict11)

data

  Subject  Age    Group
0     S01   23  Control
1     S02   31  Patient
2     S03   29  Control

In [23]:
data['AgeGroup'] = ['Young', 'Adult', 'Adult']
data

  Subject  Age    Group AgeGroup
0     S01   23  Control    Young
1     S02   31  Patient    Adult
2     S03   29  Control    Adult

- ## *we can use dataframe for nested lists or ndarrays, as well :*

In [9]:

arr = np.array([
    [0.85, 0.92, 0.78],
    [0.80, 0.95, 0.75],
    [0.88, 0.90, 0.82]
])

df = pd.DataFrame(arr, columns=["V1", "FFA", "PPA"])
df

     V1   FFA   PPA
0  0.85  0.92  0.78
1  0.80  0.95  0.75
2  0.88  0.90  0.82

In [25]:
pd.DataFrame([[1 , 2 , 3],
              [4 , 5 , 6],
              [7 , 8 , 9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

- ## *changing index with specific values :*

In [26]:
pd.DataFrame([[6 , 5 , 12],
              [6 , 5 , 12],
              [6 , 6 , 13]],
            index= ['score' , 'grade' , 'age'])

       0  1   2
score  6  5  12
grade  6  5  12
age    6  6  13

- ## *changing index and columns with specific values :*

In [27]:
pd.DataFrame([[6 , 5 , 12],
              [6 , 5 , 12],
              [6 , 6 , 13]],
            index= ['score' , 'grade' , 'age'],
            columns = ['S1' , 'S2' , 'S3'])

       S1  S2  S3
score   6   5  12
grade   6   5  12
age     6   6  13

- ## *adding a specific value as new index :*

In [28]:
data = pd.DataFrame({
    'Subject': ['S01', 'S02', 'S03'],
    'Age': [23, 31, 29],
    'Group': ['Control', 'Patient', 'Control']
})

data

  Subject  Age    Group
0     S01   23  Control
1     S02   31  Patient
2     S03   29  Control

In [29]:
df = pd.DataFrame(data).set_index("Group")
df

        Subject  Age
Group
Control     S01   23
Patient     S02   31
Control     S03   29

- ## *Adding a Column to a Pandas DataFrame :*

In [30]:
data["Country"] = "USA"
data

  Subject  Age    Group Country
0     S01   23  Control     USA
1     S02   31  Patient     USA
2     S03   29  Control     USA

In [31]:
data["Country"] = ["USA", "IRAN", "CHINA"]
data

  Subject  Age    Group Country
0     S01   23  Control     USA
1     S02   31  Patient    IRAN
2     S03   29  Control   CHINA

In [32]:
data["Salary"] = [50000, 60000, 70000]
data["Bonus"] = [5000, 7000, 6000]

data

  Subject  Age    Group Country  Salary  Bonus
0     S01   23  Control     USA   50000   5000
1     S02   31  Patient    IRAN   60000   7000
2     S03   29  Control   CHINA   70000   6000

In [35]:
data["income"] = data["Salary"] + data["Bonus"]
data

  Subject  Age    Group Country  Salary  Bonus  income
0     S01   23  Control     USA   50000   5000   55000
1     S02   31  Patient    IRAN   60000   7000   67000
2     S03   29  Control   CHINA   70000   6000   76000

- ## *Adding a Column Using apply() (Custom Function)*

In [36]:
data["Salary Category"] = data["Salary"].apply(lambda x: "High" if x > 60000 else "Medium")
data

  Subject  Age    Group Country  Salary  Bonus  income Salary Category
0     S01   23  Control     USA   50000   5000   55000          Medium
1     S02   31  Patient    IRAN   60000   7000   67000          Medium
2     S03   29  Control   CHINA   70000   6000   76000            High

- ## *Adding a Column with a Condition (np.where()) :*

In [37]:
data["Has Bonus"] = np.where(data["Bonus"] > 5000, "Yes", "No")
data

,Subject,Age,Group,Country,Salary,Bonus,income,Salary Category,Has Bonus
0,S01,23,Control,USA,50000,5000,55000,Medium,No
1,S02,31,Patient,IRAN,60000,7000,67000,Medium,Yes
2,S03,29,Control,CHINA,70000,6000,76000,High,Yes

- ## *Adding a Column Using .insert() :*

In [38]:
data.insert(1, "Experience", [2, 5, 7])
data

,Subject,Experience,Age,Group,Country,Salary,Bonus,income,Salary Category,Has Bonus
0,S01,2,23,Control,USA,50000,5000,55000,Medium,No
1,S02,5,31,Patient,IRAN,60000,7000,67000,Medium,Yes
2,S03,7,29,Control,CHINA,70000,6000,76000,High,Yes

In [39]:
data.drop(["Experience"], axis=1)

,Subject,Age,Group,Country,Salary,Bonus,income,Salary Category,Has Bonus
0,S01,23,Control,USA,50000,5000,55000,Medium,No
1,S02,31,Patient,IRAN,60000,7000,67000,Medium,Yes
2,S03,29,Control,CHINA,70000,6000,76000,High,Yes

- ## *Adding a Column with NaN Values (for Future Data Entry) :*

In [40]:
data["Performance"] = np.nan
data

,Subject,Experience,Age,Group,Country,Salary,Bonus,income,Salary Category,Has Bonus,Performance
0,S01,2,23,Control,USA,50000,5000,55000,Medium,No,NaN
1,S02,5,31,Patient,IRAN,60000,7000,67000,Medium,Yes,NaN
2,S03,7,29,Control,CHINA,70000,6000,76000,High,Yes,NaN

In [12]:
#path = r'F:\neurotasks\interdisciplinary schools\2025-mentoring\python\sess3\train.csv'
data = pd.read_csv(r'F:\neurotasks\interdisciplinary schools\2025-mentoring\python\sess3\train.csv')
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- ## *Structure of DataFrame :*

In [42]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

- ## *Summary statistics :*

In [43]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

- ## *Check for missing (NaN) values :*

In [44]:
data.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

- ## *Count of NaNs per column :*

In [45]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [46]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- ## *Renaming Columns :*

In [47]:
data.rename(columns={'PassengerId': 'Subject'}, inplace=True)
data

,Subject,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- ## *Value Counts and Unique Values*

   > *Very useful for checking categorical data quality.*

In [48]:
data['Age'].value_counts()

Age
24.00    30
22.00    27
18.00    26
28.00    25
30.00    25
         ..
24.50     1
0.67      1
0.42      1
34.50     1
74.00     1
Name: count, Length: 88, dtype: int64

- ## *replace NaN motion with 0 :*

In [49]:
data['Cabin'].fillna(0, inplace=True)
data

C:\Users\fjafa\AppData\Local\Temp\ipykernel_2640\2347363227.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Cabin'].fillna(0, inplace=True)

,Subject,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,0,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,0,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,0,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,0,Q

In [ ]:
#df[col].method(value, inplace=True)
#df.method({col: value}, inplace=True)  or df[col] = df[col].method(value)
data['Cabin'].fillna(0, inplace=True)

df.fillna({"Cabin" : 0}, inplace=True)
# df["Cabin"] = df["Cabin"].fillna(0)

In [13]:
data.dropna(axis = 1, inplace = False)
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- ## *Sort data (e.g., by age) :*

In [51]:
data.sort_values(by='Age', ascending=False)

,Subject,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,0,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,0,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,0,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,0,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,0,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,0,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,0,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,0,S

- ## *Comparison :*

In [52]:
data.groupby('Sex')['Age'].describe()

        count       mean        std   min   25%   50%   75%   max
Sex
female  261.0  27.915709  14.110146  0.75  18.0  27.0  37.0  63.0
male    453.0  30.726645  14.678201  0.42  21.0  29.0  39.0  80.0

- ## *Using column names (like dictionaries) :*

In [53]:
data["Subject"]

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: Subject, Length: 891, dtype: int64

In [54]:
data[["Name", "Survived"]]

                                                  Name  Survived
0                              Braund, Mr. Owen Harris         0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...         1
2                               Heikkinen, Miss. Laina         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)         1
4                             Allen, Mr. William Henry         0
..                                                 ...       ...
886                              Montvila, Rev. Juozas         0
887                       Graham, Miss. Margaret Edith         1
888           Johnston, Miss. Catherine Helen "Carrie"         0
889                              Behr, Mr. Karl Howell         1
890                                Dooley, Mr. Patrick         0

[891 rows x 2 columns]

In [55]:
data.Name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

---

#  **Selection and Indexing**
| Type | Description | Example |
|------|-------------|---------|
| Get item | Select column | `df['onset']` |
| loc | Label-based | `df.loc[0, 'duration']` |
| iloc | Position-based | `df.iloc[0, 2]` |
| Boolean Indexing | Conditional | `df[df['condition'] == 'task']` |

## **`loc` & `iloc`**

In [3]:
import pandas as pd

In [56]:
data

,Subject,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,0,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,0,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,0,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,0,Q

In [57]:
print(data.loc[1])

Subject                                                     2
Survived                                                    1
Pclass                                                      1
Name        Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                    female
Age                                                      38.0
SibSp                                                       1
Parch                                                       0
Ticket                                               PC 17599
Fare                                                  71.2833
Cabin                                                     C85
Embarked                                                    C
Name: 1, dtype: object

In [58]:
print(data.loc[1, "Ticket"])

PC 17599

> ##### *Selecting multiple values using `.loc[ ]`*

In [59]:
print(data.loc[[0, 2], ["Name", "Ticket"]])

                      Name            Ticket
0  Braund, Mr. Owen Harris         A/5 21171
2   Heikkinen, Miss. Laina  STON/O2. 3101282

In [61]:
data.loc[[0, 2]]

,Subject,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,0,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,0,S

In [14]:
data1 = {
    "Region": ["North", "North", "South", "South", "East", "East"],
    "City": ["New York", "Boston", "Miami", "Houston", "Chicago", "Detroit"],
    "Sales": [200, 150, 180, 220, 130, 170]
}

df = pd.DataFrame(data1)

df

  Region      City  Sales
0  North  New York    200
1  North    Boston    150
2  South     Miami    180
3  South   Houston    220
4   East   Chicago    130
5   East   Detroit    170

In [15]:
df1 = df.set_index(["Region"])
df1

            City  Sales
Region
North   New York    200
North     Boston    150
South      Miami    180
South    Houston    220
East     Chicago    130
East     Detroit    170

In [16]:
df1.iloc[[2,3]]

           City  Sales
Region
South     Miami    180
South   Houston    220

In [17]:
df1.iloc[["North"]]

ValueError: invalid literal for int() with base 10: np.str_('North')

In [68]:
df1.loc[2]

KeyError: 2

In [70]:
df1.loc["North"]

            City  Sales
Region
North   New York    200
North     Boston    150

In [71]:
df1.iloc[[2,3]]

           City  Sales
Region
South     Miami    180
South   Houston    220

In [72]:
df1.iloc[["North"]]

ValueError: invalid literal for int() with base 10: np.str_('North')

In [18]:
data1 = {
    "Region": ["North", "North", "South", "South", "East", "East"],
    "City": ["New York", "Boston", "Miami", "Houston", "Chicago", "Detroit"],
    "Sales": [200, 150, 180, 220, 130, 170]
}

df = pd.DataFrame(data1)
df

  Region      City  Sales
0  North  New York    200
1  North    Boston    150
2  South     Miami    180
3  South   Houston    220
4   East   Chicago    130
5   East   Detroit    170

In [27]:
filtered = df.loc[df["Sales"] > 100]
print(filtered)

  Region      City  Sales
0  North  New York    200
1  North    Boston    150
2  South     Miami    180
3  South   Houston    220
4   East   Chicago    130
5   East   Detroit    170

In [ ]:
df.set_index(["Region", "City"])

                 Sales
Region City
North  New York    200
       Boston      150
South  Miami       180
       Houston     220
East   Chicago     130
       Detroit     170

In [ ]:
df.loc[("South", "Miami")]

Sales    180
Name: (South, Miami), dtype: int64

## *Selecting Data Based on Conditions(booleans)*

In [73]:
#Selecting people older than 25
data["Age"] > 25

0      False
1       True
2       True
3       True
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Age, Length: 891, dtype: bool

In [ ]:
data["Age"] > np.median(data["Age"])

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [ ]:

#Selecting people with SibSp == 1 and Age < 30
(data["SibSp"] == 1) & (data["Age"] < 30)

0       True
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

---

# **Using `.groupby()`**

## *The groupby() function follows this approach:*

 > *1 - Split: The data is split into groups based on a specified key (column values).*

 > *2 - Apply: A function (e.g., sum, mean, count) is applied to each group separately.*

 > *3 - Combine: The results are combined into a new DataFrame or Series.*

In [ ]:
data = {
    "Department": ["HR", "HR", "IT", "IT", "IT", "Finance", "Finance"],
    "Employee": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank", "Grace"],
    "Salary": [5000, 6000, 7000, 8000, 7500, 9000, 9500],
    "Experience": [2, 4, 6, 8, 5, 10, 12]
}

df = pd.DataFrame(data)
df

  Department Employee  Salary  Experience
0         HR    Alice    5000           2
1         HR      Bob    6000           4
2         IT  Charlie    7000           6
3         IT    David    8000           8
4         IT      Eve    7500           5
5    Finance    Frank    9000          10
6    Finance    Grace    9500          12

In [ ]:
# Sum of Salaries per Department
df.groupby("Department")["Salary"].sum()

Department
Finance    18500
HR         11000
IT         22500
Name: Salary, dtype: int64

In [ ]:
# Average Experience per Department
df.groupby("Department")["Experience"].mean()

Department
Finance    11.000000
HR          3.000000
IT          6.333333
Name: Experience, dtype: float64

---

# **Merging and Joining Different Tables**

| Method         | Type                     | Syntax Example                            | Description / Join Type                                |
| -------------- | ------------------------ | ----------------------------------------- | ------------------------------------------------------ |
|  `pd.concat()` | Vertical      | pd.concat(\[df1, df2], axis=0)            | Stack DataFrames vertically (e.g., sessions, subjects) |
|                | Horizontal  | pd.concat(\[df1, df2], axis=1)            | Combine columns side by side (e.g., features)          |
|  `pd.merge()`  | Inner Join               | pd.merge(df1, df2, on='key')              | Keeps only rows with matching keys in both             |
|                | Left Join                | pd.merge(df1, df2, on='key', how='left')  | All rows from df1 + matching rows from df2             |
|                | Right Join               | pd.merge(df1, df2, on='key', how='right') | All rows from df2 + matching rows from df1             |
|                | Outer Join               | pd.merge(df1, df2, on='key', how='outer') | All rows from both, fill missing with NaN              |

## **Using concat() for Joining Tables**

### *Vertical Concatenation (Stacking Rows)*

In [ ]:
df1 = pd.DataFrame({
    "ID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "Salary": [5000, 6000, 7000]
})

df2 = pd.DataFrame({
    "ID": [4, 5, 6],
    "Name": ["David", "Eve", "Frank"],
    "Salary": [7500, 8000, 8500]
})

# Concatenating along rows
result = pd.concat([df1, df2], axis=0)
result

   ID     Name  Salary
0   1    Alice    5000
1   2      Bob    6000
2   3  Charlie    7000
0   4    David    7500
1   5      Eve    8000
2   6    Frank    8500

In [ ]:
result1 = pd.concat([df1, df2], ignore_index=True)
result1

   ID     Name  Salary
0   1    Alice    5000
1   2      Bob    6000
2   3  Charlie    7000
3   4    David    7500
4   5      Eve    8000
5   6    Frank    8500

### *Horizontal Concatenation (Merging Columns)*

In [ ]:
df3 = pd.DataFrame({
    "ID": [1, 2, 3],
    "Department": ["HR", "IT", "Finance"]
})

df4 = pd.DataFrame({
    "ID": [1, 2, 3],
    "Experience": [2, 4, 6]
})

In [ ]:
result = pd.concat([df3, df4], axis=0)
result

   ID Department  Experience
0   1         HR         NaN
1   2         IT         NaN
2   3    Finance         NaN
0   1        NaN         2.0
1   2        NaN         4.0
2   3        NaN         6.0

## **Using `merge()` for Database-Style Joins**

> *`Inner Join` -> Keeps only matching rows*

> *`Left Join` -> Keeps all rows from the left DataFrame*

> *`Right Join` -> Keeps all rows from the right DataFrame*

> *`Outer Join` -> Keeps all rows from both DataFrames*

In [ ]:
df5 = pd.DataFrame({
    "ID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "Salary": [5000, 6000, 7000]
})

df6 = pd.DataFrame({
    "ID": [2, 3, 4],
    "Department": ["IT", "Finance", "HR"]
})

### *Inner Join (Keeps only matching rows)*

In [ ]:
pd.merge(df5, df6, on="ID")

   ID     Name  Salary Department
0   2      Bob    6000         IT
1   3  Charlie    7000    Finance

### *Left Join (Keep All Rows from Left)*

In [ ]:
pd.merge(df5, df6, on="ID", how="left")

   ID     Name  Salary Department
0   1    Alice    5000        NaN
1   2      Bob    6000         IT
2   3  Charlie    7000    Finance

### *Right Join (Keep All Rows from Right)*

In [ ]:
pd.merge(df5, df6, on="ID", how="right")

   ID     Name  Salary Department
0   2      Bob  6000.0         IT
1   3  Charlie  7000.0    Finance
2   4      NaN     NaN         HR

### *Outer Join (Keep All Rows)*

In [ ]:
pd.merge(df5, df6, on="ID", how="outer")

   ID     Name  Salary Department
0   1    Alice  5000.0        NaN
1   2      Bob  6000.0         IT
2   3  Charlie  7000.0    Finance
3   4      NaN     NaN         HR

---

# **Summarizing DataFrames in Pandas**

| Function                             | Purpose                                          | Example Code                                |
| ------------------------------------ | ------------------------------------------------ | ------------------------------------------- |
| `df.info()`                          | Overview of columns, dtypes, and non-null counts | `df.info()`                                 |
| `df.describe()`                      | Summary stats of numerical columns               | `df.describe()`                             |
| `df.isnull()`                        | Detect missing values (NaN)                      | `df.isnull()`                               |
| `df.isnull().sum()`                  | Count NaNs per column                            | `df.isnull().sum()`                         |
| `df.notnull()`                       | Detect non-missing values                        | `df.notnull()`                              |
| `df.dropna()`                        | Remove rows with NaNs                            | `df.dropna(subset=['motion'])`              |
| `df.fillna(value)`                   | Fill NaNs with a value                           | `df.fillna(0)`                              |
| `df.rename()`                        | Rename columns                                   | `df.rename(columns={'old':'new'})`          |
| `df.duplicated()`                    | Detect duplicated rows                           | `df[df.duplicated()]`                       |
| `df.duplicated().sum()`              | Count duplicated rows                            | `df.duplicated().sum()`                     |
| `df.value_counts()`                  | Count occurrences of each unique value (1D only) | `df['event_type'].value_counts()`           |
| `df.unique()`                        | List of unique values in a column                | `df['subject'].unique()`                    |
| `df.isin([...])`                     | Filter rows based on a list of values            | `df[df['site'].isin(['siteA','siteB'])]`    |
| `df.nunique()`                       | Count of unique values per column                | `df['diagnosis'].nunique()`                 |
| `df.mean()` / `.median()` / `.std()` | Summary stats (mean, median, std deviation)      | `df['motion'].mean()`                       |
| `df.min()` / `df.max()`              | Min/max of column values                         | `df['age'].min()`                           |
| `df.sort_values(by='col')`           | Sort rows by a column                            | `df.sort_values(by='age', ascending=False)` |
| `df.corr()`                          | Correlation between numeric columns              | `df[['age','motion']].corr()`               |
| `df.groupby(...).describe()`         | Summary stats grouped by category                | `df.groupby('diagnosis')['age'].describe()` |

| Operation         | Function                            |
| ----------------- | ----------------------------------- |
| Read local CSV    | `pd.read_csv("file.csv")`           |
| Read CSV from URL | `pd.read_csv(url)`                  |
| Read Excel        | `pd.read_excel("file.xlsx")`        |
| Read TSV          | `pd.read_csv("file.tsv", sep="\t")` |
| Read JSON         | `pd.read_json()`                    |
| Save CSV          | `df.to_csv()`                       |
| Save Excel        | `df.to_excel()`                     |
| Save TSV          | `df.to_csv(sep="\t")`               |

## **TASKS**

> ## **Question 1:**

- Loading and Exploring Neuroimaging Data

      `Dataset: "fmri_data.csv"`

. Subject_ID: Unique identifier for each subject

. Condition: Resting-state or Task-based

. Region: Brain region where the signal is measured

. Signal_Intensity: Average fMRI signal for the region

. Motion_Correction: A boolean flag for whether motion correction was applied

>  Tasks:

- Load the dataset into a Pandas DataFrame.
  
- Display the first 7 rows.

- Show summary statistics of numerical columns.

- Find the total number of unique brain regions in the dataset.

- Check for missing values and report them.

> ## **YOUR ANSWER:**



- Loading and Exploring Neuroimaging Data

      `Dataset: "fmri_data.csv"`

. Subject_ID: Unique identifier for each subject

. Condition: Resting-state or Task-based

. Region: Brain region where the signal is measured

. Signal_Intensity: Average fMRI signal for the region

. Motion_Correction: A boolean flag for whether motion correction was applied

- Load the dataset into a Pandas DataFrame.

- Display the first 7 rows.

- Show summary statistics of numerical columns.

- Find the total number of unique brain regions in the dataset.

- Check for missing values and report them.

---

> ## **Question 2:**

**Handling Missing Data in PET Scans**

`Dataset: "scan_results.csv"`

- Patient_ID: Unique identifier for each patient

- Glucose_Uptake: Numeric column (some values are missing)

- Dopamine_Receptor_Density: Categorical column (some values are missing)

- Age: Numeric column

   > Tasks:

   - Load the dataset into a Pandas DataFrame.

   - Identify missing values in each column.

   - Fill missing values in Glucose_Uptake with the median of that column.

   - Fill missing values in Dopamine_Receptor_Density with the most frequent category (mode).

   - Print the updated DataFrame and confirm that no missing values remain.

> ## **YOUR ANSWER:**


**Handling Missing Data in PET Scans**

`Dataset: "scan_results.csv"`

- Patient_ID: Unique identifier for each patient

- Glucose_Uptake: Numeric column (some values are missing)

- Dopamine_Receptor_Density: Categorical column (some values are missing)

- Age: Numeric column

   - Load the dataset into a Pandas DataFrame.

- Identify missing values in each column.

- Fill missing values in Glucose_Uptake with the median of that column.

- Fill missing values in Dopamine_Receptor_Density with the most frequent category (mode).

- Print the updated DataFrame and confirm that no missing values remain.

---

> ## **Question 3:**

**Indexing and Selecting Data from a DTI Dataset**

`Dataset: "metrics.csv"`

- Subject_ID

- FA (Fractional Anisotropy)

- MD (Mean Diffusivity)

- Group: Control vs. Patient

     > Tasks:

     - Set Subject_ID as the index of the DataFrame.

     - Retrieve MD values for all subjects in the "Patient" group.

     - Select subjects with FA > 0.6 and MD < 0.002.

     - Extract MD value for a specific Subject_ID (e.g., 'Sub_10') using .loc[].

     - Reset the index and display the first 6 rows.

> ## **YOUR ANSWER:**

`Dataset: "metrics.csv"`

- Subject_ID

- FA (Fractional Anisotropy)

- MD (Mean Diffusivity)

- Group: Control vs. Patient

- Set Subject_ID as the index of the DataFrame.

- Retrieve MD values for all subjects in the "Patient" group.

- Select subjects with FA > 0.6 and MD < 0.002.

- Extract MD value for a specific Subject_ID (e.g., 'Sub_10') using .loc[].

- Reset the index and display the first 6 rows.

---

> ## **Question 4:**

**Performing Arithmetic and Grouping on SPECT Data**

`Dataset: "data1.csv"`

- Patient_ID

- Left_Hemisphere_Activity

- Right_Hemisphere_Activity

- Diagnosis (Normal vs. Alzheimer’s)

    > Tasks:

    - Compute a new column called Hemisphere_Difference = |Left − Right|.

    - Compute the median intensity difference for patients diagnosed with Normal. 

    - Normalize Right_Hemisphere_Activity by dividing it by the maximum value in that column. 

    - Group by Diagnosis and compute the mean of Hemisphere_Difference.

> ## **YOUR ANSWER:**

**Performing Arithmetic and Grouping on SPECT Data**

`Dataset: "data1.csv"`

- Patient_ID

- Left_Hemisphere_Activity

- Right_Hemisphere_Activity

- Diagnosis (Normal vs. Alzheimer’s)


    > Tasks:

- Compute a new column called Hemisphere_Difference = Left − Right.

- Compute the median intensity difference for patients diagnosed with Normal.

- Normalize Right_Hemisphere_Activity by dividing it by the maximum value in that column.

- Group by Diagnosis and compute the mean of Hemisphere_Difference.

---

> ## **Question 5:**

**Merging Two Neuroimaging DataFrames**

`Dataset 1: "fmri_signals.csv"`

- Subject_ID

- Region

- Signal_Intensity

`Dataset 2: "behavioral_scores.csv"`

- Subject_ID

- Cognitive_Score


    > Tasks:

    - Load both datasets.

    - Merge them on Subject_ID.

    - Keep only subjects that exist in both datasets (inner join).

    - Compute the maximum Signal_Intensity for each (Region, Cognitive_Score) group

> ## **YOUR ANSWER:**

**Merging Two Neuroimaging DataFrames**

`Dataset 1: "fmri_signals.csv"`

- Subject_ID

- Region

- Signal_Intensity

`Dataset 2: "behavioral_scores.csv"`

- Subject_ID

- Cognitive_Score


    > Tasks:

- Load both datasets.

- Merge them on Subject_ID.

- Keep only subjects that exist in both datasets (inner join).

- Compute the maximum Signal_Intensity for each (Region, Cognitive_Score) group

---